"""
Вопросы:
    - Правильно ли при формировании графика работ считать, что врач в рамках смены выполняет
    максимальную норму? Какое значение имеет минимальная норма?
    - Есть ли приоритет или правила при распределении работ в рамках одной модальности (КТ, МРТ) по: без КУ, КУ1 и КУ2?
    - Допустимо ли, чтобы врач выполнял в рамках смены работы по нескольким модальностям,
    если они у него заданы (с приоритетом основной, конечно)?
    - Правильно ли, что в течение недели работы должны быть распределены равномерно, включая общепринятые
    выходные дни и штатные расписания составлены с учётом равномерной работы в течение недели (т.е., например,
    при графике 5/2 у врача выходными могут быть среда-четверг? // Или есть, например, приоритет, что при 5-ти дневной рабочей неделе работать желательно
    с понедельника по пятницу, а суббота-воскресенье – выходные? Или приоритетом является трудовой распорядок
    и пожелания врача - какой график составлен на месяц, такой и приоритет?
    - При графике 2/2 какие действуют ограничения по времени работы - 48 часов выходных подряд и общее время
    в месяц не более месячной нормы времени по производственному календарю? Или как?
    - Предоставленные нормативы времени определены на 8 часов рабочего времени?
    - К чему относятся модальности "РХ", "НДКТ" "ПЭТ/КТ", содержащиеся в предоставленном примере табеля? Их отнести
    к каким-то имеющимся модальностям в нормативах времени или просто игнорировать?
    - При ставке менее 1.0, нужно уменьшать продолжительность рабочих дней (сохраняя выбранный график работ)
        или количество рабочих дней (сохраняя их продожительность)?
    - При графике 2/2 предоставляется ли врачу дополнительный выходной день, если выходной по его графику
    приходится на праздничный день?

    Развитие:
        скользящий график
"""


if __name__ == '__main__':
    """
    Для управления алгоритмом вызываются соответствующие методы через командную строку.
    """
    pass